Autodesk.Revit.DB.DWFImportOptions.SetSheetViews(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Set sheet views where DWF markups are imported.
sheetViews:
An array of imported sheet views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DWFImportOptions.#ctor(Autodesk.Revit.DB.DWFImportOptions)
Constructs a new instance of DWFImportOptions as a copy of the import options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DWFImportOptions.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Constructs a new instance of DWFImportOptions with an array of imported sheet views.
views:
These sheet views where DWF markups are imported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014